In [16]:
import numpy as np
import pandas as pd

arreglo = np.array([["Bella", "Labrador", "Café", 56, 24, "2013-07-01"], 
                    ["Charlie", "Poodle", "Negro", 43, 24, "2016-09-16"],
                   ["Lucy", "Chow chow", "Café", 46, 24, "2014-08-25"],
                   ["Cooper", "Schnauzer", "Gris", 49, 17, "2011-12-11"],
                    ["Bernie","San Bernardo", "Blanco", 77, 74, "2018-02-27"],
                   ["Max", "Chow chow", "Blanco", 45, 28, "2019-03-27"],
                    ["Reed", "Schnauzer", "Negro", 45, 15, "2017-09-18"]])
arreglo

array([['Bella', 'Labrador', 'Café', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27'],
       ['Max', 'Chow chow', 'Blanco', '45', '28', '2019-03-27'],
       ['Reed', 'Schnauzer', 'Negro', '45', '15', '2017-09-18']],
      dtype='<U12')

In [4]:
df = pd.DataFrame(data=arreglo, columns=["Nombre", "Raza", "Color", "Altura_cm", "Peso_kg", "Fecha_Nac"])
df

    Nombre          Raza   Color Altura_cm Peso_kg   Fecha_Nac
0    Bella      Labrador    Café        56      24  2013-07-01
1  Charlie        Poodle   Negro        43      24  2016-09-16
2     Lucy     Chow chow    Café        46      24  2014-08-25
3   Cooper     Schnauzer    Gris        49      17  2011-12-11
4   Bernie  San Bernardo  Blanco        77      74  2018-02-27

In [5]:
##Extraer registros de los perros cuya fecha de nacimiento es anterior al 1 de enero 2015
df2 = df[df["Fecha_Nac"] < "2015-01-01"]
df2

   Nombre       Raza Color Altura_cm Peso_kg   Fecha_Nac
0   Bella   Labrador  Café        56      24  2013-07-01
2    Lucy  Chow chow  Café        46      24  2014-08-25
3  Cooper  Schnauzer  Gris        49      17  2011-12-11

In [7]:
##Registros en donde la altura sea mayor a 50cm
df["Altura_cm"] = df["Altura_cm"].astype(int)
df[df["Altura_cm"]>50]

   Nombre          Raza   Color  Altura_cm Peso_kg   Fecha_Nac
0   Bella      Labrador    Café         56      24  2013-07-01
4  Bernie  San Bernardo  Blanco         77      74  2018-02-27

In [12]:
##Agregue una nueva columna donde de indique el IMM para cada perro IMM=(pesokg)/(Alturam)
df["Peso_kg"] = df["Peso_kg"].astype(int)
df["IMM"] = df["Peso_kg"] / (df["Altura_cm"]/100)**2
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac         IMM
0    Bella      Labrador    Café         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow chow    Café         46       24  2014-08-25  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [14]:
df2 = df[["Nombre", "Raza", "IMM"]]
df2 = df2.sort_values("IMM", ascending = True)
df2

    Nombre          Raza         IMM
3   Cooper     Schnauzer   70.803832
0    Bella      Labrador   76.530612
2     Lucy     Chow chow  113.421550
4   Bernie  San Bernardo  124.810255
1  Charlie        Poodle  129.799892

In [17]:
df["Peso_kg"].mean()

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac         IMM
0    Bella      Labrador    Café         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow chow    Café         46       24  2014-08-25  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [18]:
arreglo = np.array([["Bella", "Labrador", "Café", 56, 24, "2013-07-01"], 
                    ["Charlie", "Poodle", "Negro", 43, 24, "2016-09-16"],
                   ["Lucy", "Chow chow", "Café", 46, 24, "2014-08-25"],
                   ["Cooper", "Schnauzer", "Gris", 49, 17, "2011-12-11"],
                    ["Bernie","San Bernardo", "Blanco", 77, 74, "2018-02-27"],
                   ["Max", "Chow chow", "Blanco", 45, 28, "2019-03-27"],
                    ["Reed", "Schnauzer", "Negro", 45, 15, "2017-09-18"]])
arreglo

array([['Bella', 'Labrador', 'Café', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow chow', 'Café', '46', '24', '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27'],
       ['Max', 'Chow chow', 'Blanco', '45', '28', '2019-03-27'],
       ['Reed', 'Schnauzer', 'Negro', '45', '15', '2017-09-18']],
      dtype='<U12')

In [19]:
df = pd.DataFrame(data=arreglo, columns= ['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_nac'])
df['Altura_cm'] = df['Altura_cm'].astype(int)
df['Peso_kg'] = df['Peso_kg'].astype(int)
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac
0    Bella      Labrador    Café         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow chow    Café         46       24  2014-08-25
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27
5      Max     Chow chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [20]:
#Calculo media
df['Peso_kg'].mean()

29.428571428571427

In [23]:
##Fecha de nac más antigua
df['Fecha_nac'].min()

'2011-12-11'

In [24]:
##Función agregación estadisitica
def percentil180(columna):
    return columna.quantile(0.80)
df['Altura_cm'].agg(percentil180)

54.60000000000001

In [25]:
##Agrupación estadistica en varias columnas
df[['Altura_cm', 'Peso_kg']].agg(percentil180)

Altura_cm    54.6
Peso_kg      27.2
dtype: float64

In [27]:
def percentil190(columna):
    return columna.quantile(0.90)
df['Altura_cm'].agg([percentil180, percentil190])

percentil180    54.6
percentil190    64.4
Name: Altura_cm, dtype: float64

In [28]:
df['Raza'].value_counts()

Chow chow       2
Schnauzer       2
Labrador        1
Poodle          1
San Bernardo    1
Name: Raza, dtype: int64

In [30]:
df.groupby('Raza')['Peso_kg'].mean()

Raza
Chow chow       26.0
Labrador        24.0
Poodle          24.0
San Bernardo    74.0
Schnauzer       16.0
Name: Peso_kg, dtype: float64

In [31]:
##Tablas pivot
df.pivot_table(values = 'Peso_kg', index = 'Color', aggfunc = [np.mean, np.median])

          mean  median
       Peso_kg Peso_kg
Color
Blanco    51.0    51.0
Café      24.0    24.0
Gris      17.0    17.0
Negro     19.5    19.5

In [34]:
arreglo = np.array([["Bella", "Labrador", "Café", 56, 24, "2013-07-01"], 
                    ["Charlie", "Poodle", "Negro", 43, 24, "2016-09-16"],
                   ["Lucy", "Chow chow", "Café", 46, 24, "2014-08-25"],
                   ["Cooper", "Schnauzer", "Gris", 49, 17, "2011-12-11"],
                    ["Bernie","San Bernardo", "Blanco", 77, 74, "2018-02-27"],
                   ["Max", "Chow chow", "Blanco", 45, 28, "2019-03-27"],
                    ["Reed", "Schnauzer", "Negro", 45, 15, "2017-09-18"]])
arreglo
df = pd.DataFrame(data=arreglo, columns= ['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_nac'])
df['Altura_cm'] = df['Altura_cm'].astype(int)
df['Peso_kg'] = df['Peso_kg'].astype(int)
df_ind = df.set_index('Nombre')
df_ind

                 Raza   Color  Altura_cm  Peso_kg   Fecha_nac
Nombre
Bella        Labrador    Café         56       24  2013-07-01
Charlie        Poodle   Negro         43       24  2016-09-16
Lucy        Chow chow    Café         46       24  2014-08-25
Cooper      Schnauzer    Gris         49       17  2011-12-11
Bernie   San Bernardo  Blanco         77       74  2018-02-27
Max         Chow chow  Blanco         45       28  2019-03-27
Reed        Schnauzer   Negro         45       15  2017-09-18